{
  "backend/main.mo": "IC actor managing user profiles with access control and storing contact submissions with admin‑restricted retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light/dark theme tokens for the SmartBreak design system.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Initializes theme and query client, rendering the SmartBreak landing page and global toaster.",
  "frontend/src/components/marketing/AnimatedInView.tsx": "Wrapper that fades and slides elements into view using IntersectionObserver.",
  "frontend/src/components/marketing/FeatureCard.tsx": "UI card component showing an icon, title, and description for feature highlights.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "About section describing SmartBreak's research background with animated intro.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Contact form section handling input validation, submission via a mutation hook, and success/error toasts.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Landing hero section with headline, description, demo CTA scroll, and technical brief download button.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Displays six-step visual workflow explaining the SmartBreak detection and isolation process.",
  "frontend/src/components/marketing/sections/ImpactSection.tsx": "Shows societal impacts of SmartBreak with icons and supporting imagery.",
  "frontend/src/components/marketing/sections/ProblemSection.tsx": "Outlines key dangers in LV distribution networks using a list of problems and an infographic.",
  "frontend/src/components/marketing/sections/SimulationSection.tsx": "Presents MATLAB simulation results with a waveform image and bullet-pointed findings.",
  "frontend/src/components/marketing/sections/SolutionSection.tsx": "Describes SmartBreak’s core features and includes a system architecture image.",
  "frontend/src/components/marketing/sections/TechnologySection.tsx": "Lists advanced technologies behind SmartBreak using FeatureCard components.",
  "frontend/src/components/marketing/SectionShell.tsx": "Reusable section wrapper providing vertical spacing and container layout.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Footer with copyright text and a caffeine.ai attribution link.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Fixed header with smooth‑scroll navigation and responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status flags.",
  "frontend/src/hooks/useInViewAnimation.ts": "Custom hook using IntersectionObserver to trigger delayed visibility-based animations.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation hook for creating contact submissions through an actor and invalidates the submissions query on success.",
  "frontend/src/hooks/useSmoothScroll.ts": "Exposes a function to smoothly scroll to a page element by ID with a fixed header offset.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode settings, custom utilities, and global typography/background rules.",
  "frontend/src/lib/utils.ts": "Exports a helper that merges conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider wrappers.",
  "frontend/src/pages/SmartBreakLandingPage.tsx": "Composes the SmartBreak marketing landing page by rendering all major section components in order.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Defines Tailwind configuration with custom colors, extended theme settings, plugins, and design tokens linked to CSS variables.",
  "project_state.json": "Captures the project’s specification, required images, features, and architectural notes for the SmartBreak marketing site."
}